zhiyb/STM32F722RE/src/usb_hw_ep.c
#include "stm32c0xx.h"
#include "semihosting.h"
#include "macros.h"
#include "bt_hci_usb.h"
#include "usb.h"

#define TXBD(count, addr) \
    (((count) << 16) | (0x0000ffff & ((uint32_t)(addr) - USB_DRD_PMAADDR)))
#define RXBD(blsize, blocks, count, addr) \
    (((blsize) << 31) | ((blocks) << 26) | ((count) << 16) | \
        (0x0000ffff & ((uint32_t)(addr) - USB_DRD_PMAADDR)))

#define TXRXDB_PTR(bd)      ((uint32_t *)(((bd) & 0x0000ffff) + USB_DRD_PMAADDR))
#define TXRXBD_COUNT(bd)    (((bd) >> 16) & 0x03ff)

#define CHEP(ch)            (*(&USB_DRD_FS->CHEP0R + ch))
#define CHEP_MASK(val)      (((val) & 0x017f070f) | 0x7e808080)

#define CHEP_RX_DISABLED(v) ((v) & USB_CHEP_RX_STRX_Msk)
#define CHEP_RX_STALL(v)    (((v) & USB_CHEP_RX_STRX_Msk) ^ (0b01 << USB_CHEP_RX_STRX_Pos))
#define CHEP_RX_NAK(v)      (((v) & USB_CHEP_RX_STRX_Msk) ^ (0b10 << USB_CHEP_RX_STRX_Pos))
#define CHEP_RX_VALID(v)    ((~(v)) & USB_CHEP_RX_STRX_Msk)

#define CHEP_TX_DISABLED(v) ((v) & USB_CHEP_TX_STTX_Msk)
#define CHEP_TX_STALL(v)    (((v) & USB_CHEP_TX_STTX_Msk) ^ (0b01 << USB_CHEP_TX_STTX_Pos))
#define CHEP_TX_NAK(v)      (((v) & USB_CHEP_TX_STTX_Msk) ^ (0b10 << USB_CHEP_TX_STTX_Pos))
#define CHEP_TX_VALID(v)    ((~(v)) & USB_CHEP_TX_STTX_Msk)

// USB endpoint buffer allocation and management

static const uint8_t map_ch_to_ep[8] = {0, 1,};

typedef volatile struct {
    struct {
        uint32_t TXRXBD;
        uint32_t RXTXBD;
    } chep[8];
    struct {
        // For enpoint 0 control
        // Shared between TX & RX
        uint32_t buf[64 / 4];
    } ch0;
    struct {
        // For IN endpoint 1 BT HCI Events
        uint32_t rx_buf[0 / 4];
        uint32_t tx_buf[64 / 4];
    } ch1;
    struct {
        // For OUT endpoint 2 BT ACL Data
        uint32_t rx_buf[2][64 / 4];
    } ch2;
    struct {
        // For OUT endpoint 3 BT Voice
        uint32_t rx_buf[2][64 / 4];
    } ch3;
    struct {
        // For endpoint 4 HID
        // For endpoint 4 CDC Comm
        uint32_t rx_buf[64 / 4];
        uint32_t tx_buf[64 / 4];
    } ch4;
    struct {
        // For endpoint 5 CDC Data
        uint32_t rx_buf[64 / 4];
        uint32_t tx_buf[64 / 4];
    } ch5;
    struct {
        // For IN endpoint 2 BT ACL Data
        uint32_t tx_buf[2][64 / 4];
    } ch6;
    struct {
        // For IN endpoint 3 BT Voice
        uint32_t tx_buf[2][64 / 4];
    } ch7;
} usb_sram_t;

// For size checking
static usb_sram_t _usb_sram __attribute__((section(".usbram"))) __attribute__((used));
static usb_sram_t * const usb_sram = (usb_sram_t *)USB_DRD_PMAADDR;

enum {Tx = 0, Rx = 1};

static const uint16_t ch_buf_size[8][2] = {
    // IN (TX), OUT (RX)
    {sizeof(usb_sram->ch0.buf), sizeof(usb_sram->ch0.buf)},
    {sizeof(usb_sram->ch1.tx_buf), sizeof(usb_sram->ch1.rx_buf)},
    {0, sizeof(usb_sram->ch2.rx_buf[0])},
    {0, sizeof(usb_sram->ch3.rx_buf[0])},
    {sizeof(usb_sram->ch4.tx_buf), sizeof(usb_sram->ch4.rx_buf)},
    {sizeof(usb_sram->ch5.tx_buf), sizeof(usb_sram->ch5.rx_buf)},
    {sizeof(usb_sram->ch6.tx_buf[0]), 0},
    {sizeof(usb_sram->ch7.tx_buf[0]), 0},
};

// In-progress TX/RX requests
static struct {
    volatile void * volatile data;
    volatile uint32_t len;
    volatile uint8_t db_valid[2];
    volatile bool first;
} txrx_req[8];          // Channel index

static volatile struct {
    setup_t setup;
    uint8_t data[256];  // DATA OUT buffer
} ctrl_buf ALIGNED(4);

// Event queue for deferring IRQ events to main thread
#define EVENT_QUEUE_SIZE    4

typedef enum {
    EventSetup  = 0x01,
    EventOut    = 0x02,
    EventIn     = 0x10,
} event_ev_t;

typedef struct {
    uint8_t event[2][8];
    uint8_t wrptr;
} hw_event_t;

static volatile hw_event_t hw_event;

static void event_push_irq(event_ev_t ev, uint8_t ch)
{
    uint8_t wrptr = hw_event.wrptr;
    hw_event.event[wrptr][ch] |= ev;
}

void usb_hw_ep_init()
{
    // Clear pending events
    hw_event = (hw_event_t){};

    // Configure channel 0 for control endpoint 0
    uint8_t ch = UsbEp0Ctrl;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch0.buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch0.buf[0]);
    txrx_req[ch].len = 0;
    ctrl_buf.setup.wLength = 0;
    // Ready for SETUP
    uint32_t chep = CHEP(ch);
    CHEP(ch) = (0b01 << USB_CHEP_UTYPE_Pos) | CHEP_RX_VALID(chep) | CHEP_TX_NAK(chep) | ch;

    // Configure channel 1 for BT HCL Events interrupt IN endpoint
    ch = UsbEpBtHciEvents;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch1.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch1.rx_buf[0]);
    txrx_req[ch].len = 0;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b11 << USB_CHEP_UTYPE_Pos) | CHEP_RX_DISABLED(chep) | CHEP_TX_NAK(chep) | ch;

    // Configure channel 2 for BT ACL Data bulk OUT endpoint, with double buffering
    ch = UsbEpBtACLData;
    usb_sram->chep[ch].TXRXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch2.rx_buf[1][0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch2.rx_buf[0][0]);
    txrx_req[ch].len = 0;
    txrx_req[ch].db_valid[0] = 0;
    txrx_req[ch].db_valid[1] = 0;
    txrx_req[ch].first = true;
    // Disable to match first state
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | USB_CHEP_KIND_Msk | CHEP_RX_DISABLED(chep) | CHEP_TX_DISABLED(chep) |
        (chep & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | ch;
    // Ready for OUT
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | USB_CHEP_KIND_Msk | CHEP_RX_VALID(chep) | CHEP_TX_DISABLED(chep) |
        (chep & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | ch;

    // Configure channel 6 for BT ACL Data bulk IN endpoint, with double buffering
    ch = UsbEpBtACLDataIn;
    usb_sram->chep[ch].TXRXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch6.tx_buf[0][0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch6.tx_buf[1][0]);
    txrx_req[ch].len = 0;
    txrx_req[ch].db_valid[0] = 0;
    txrx_req[ch].db_valid[1] = 0;
    txrx_req[ch].first = true;
    // Disable to match first state
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | USB_CHEP_KIND_Msk | CHEP_RX_DISABLED(chep) | CHEP_TX_DISABLED(chep) |
        (chep & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | UsbEpBtACLData;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | USB_CHEP_KIND_Msk | CHEP_RX_DISABLED(chep) | CHEP_TX_NAK(chep) |
        ((chep ^ USB_CHEP_DTOG_TX_Msk) & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | UsbEpBtACLData;

