zhiyb/STM32F722RE/src/usb_hw_ep.c
    // Configure channel 3 for BT Voice isochronous OUT endpoint
    ch = UsbEpBtVoice;
    usb_sram->chep[ch].TXRXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch3.rx_buf[1][0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch3.rx_buf[0][0]);
    txrx_req[ch].len = 0;
    txrx_req[ch].db_valid[0] = 0;
    txrx_req[ch].db_valid[1] = 0;
    // Disabled for now
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | CHEP_RX_DISABLED(chep) | CHEP_TX_DISABLED(chep) |
        (chep & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | ch;

    // Configure channel 7 for BT Voice isochronous IN endpoint
    ch = UsbEpBtVoiceIn;
    usb_sram->chep[ch].TXRXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch7.tx_buf[0][0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch7.tx_buf[1][0]);
    txrx_req[ch].len = 0;
    txrx_req[ch].db_valid[0] = 0;
    txrx_req[ch].db_valid[1] = 0;
    // Disabled for now
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | CHEP_RX_DISABLED(chep) | CHEP_TX_DISABLED(chep) |
        (chep & (USB_CHEP_DTOG_TX_Msk | USB_CHEP_DTOG_RX_Msk)) | UsbEpBtVoice;

    // Endpoints with alternative settings

#if USB_ALT_IF == USB_ALT_IF_HID
    // Configure channel 4 for HID interrupt endpoint
    ch = UsbEpHid;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch4.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch4.rx_buf[0]);
    txrx_req[ch].len = 0;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b11 << USB_CHEP_UTYPE_Pos) | CHEP_RX_NAK(chep) | CHEP_TX_NAK(chep) | ch;

#elif USB_ALT_IF == USB_ALT_IF_CDC
    // Configure channel 4 for CDC Comm interrupt endpoint
    ch = UsbEpCDCComm;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch4.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch4.rx_buf[0]);
    txrx_req[ch].len = 0;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b11 << USB_CHEP_UTYPE_Pos) | CHEP_RX_DISABLED(chep) | CHEP_TX_NAK(chep) | ch;

    // Configure channel 5 for CDC Data bulk endpoint
    ch = UsbEpCDCData;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch5.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch5.rx_buf[0]);
    txrx_req[ch].len = 0;
    // OUT ready
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | CHEP_RX_VALID(chep) | CHEP_TX_NAK(chep) | ch;
#endif

#if 0
    // Configure channel 1 for HID interrupt endpoint
    ch = 1;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch1.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(0, ch_buf_size[ch][Rx] / 2, 0, &usb_sram->ch1.rx_buf[0]);
    txrx_req[ch].len = 0;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b11 << USB_CHEP_UTYPE_Pos) | CHEP_RX_NAK(chep) | CHEP_TX_NAK(chep) | UsbEpHid;

    // Configure channel 2 for CDC Comm interrupt endpoint
    ch = 2;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch2.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(0, ch_buf_size[ch][Rx] / 2, 0, &usb_sram->ch2.rx_buf[0]);
    txrx_req[ch].len = 0;
    // Send NAK for now
    chep = CHEP(ch);
    CHEP(ch) = (0b11 << USB_CHEP_UTYPE_Pos) | CHEP_RX_NAK(chep) | CHEP_TX_NAK(chep) | UsbEpCDCComm;

    // Configure channel 3 for CDC Data bulk endpoint
    ch = 3;
    usb_sram->chep[ch].TXRXBD = TXBD(0, &usb_sram->ch3.tx_buf[0]);
    usb_sram->chep[ch].RXTXBD = RXBD(1, ch_buf_size[ch][Rx] / 32 - 1, 0, &usb_sram->ch3.rx_buf[0]);
    txrx_req[ch].len = 0;
    // OUT ready
    chep = CHEP(ch);
    CHEP(ch) = (0b00 << USB_CHEP_UTYPE_Pos) | CHEP_RX_VALID(chep) | CHEP_TX_NAK(chep) | UsbEpCDCData;
#endif
}

static inline uint8_t ep_to_tx_ch(uint8_t ep)
{
#if 0
    if (ep == UsbEpBtACLData)
        return UsbEpBtACLDataIn;
    else if (ep == UsbEpBtVoice)
        return UsbEpBtVoiceIn;
#endif
    return ep;
}

static inline uint8_t ep_to_rx_ch(uint8_t ep)
{
    return ep;
}

void usb_hw_ep_tx(uint8_t ep, const void *data, uint32_t len, bool status_out)
{
    uint8_t ch = ep_to_tx_ch(ep);
    const uint16_t max_len = ch_buf_size[ch][Tx];

    if (len > max_len) {
        txrx_req[ch].data = (void *)data + max_len;
        txrx_req[ch].len = len - max_len;
        len = max_len;
    } else {
        txrx_req[ch].len = 0;
    }

    // Configure SRAM buffer channel
    uint32_t *dst = TXRXDB_PTR(usb_sram->chep[ch].TXRXBD);  // TODO Double buffering support?
    const uint32_t *src = data;
    for (uint32_t i = 0; i < (len + 3) / 4; i++)
        dst[i] = src[i];
    usb_sram->chep[ch].TXRXBD = TXBD(len, dst);

    // Enable endpoint channel for IN transfer
    uint32_t chep = CHEP(ch);
    CHEP(ch) = CHEP_MASK(chep) | (status_out ? USB_CHEP_KIND_Msk : 0) | CHEP_TX_VALID(chep);
}

bool usb_hw_ep_tx_db_available(uint8_t ep)
{
    // TX with double buffering
    uint8_t ch = ep_to_tx_ch(ep);
    uint32_t chep = CHEP(ch);
    uint8_t sw_buf = !!(chep & USB_CHEP_DTOG_RX_Msk);
    return !txrx_req[ch].db_valid[sw_buf];
}

void usb_hw_ep_tx_db(uint8_t ep, const void *data, uint32_t len)
{
    // TX with double buffering
    uint8_t ch = ep_to_tx_ch(ep);
    const uint16_t max_len = ch_buf_size[ch][Tx];

    if (len > max_len) {
        txrx_req[ch].data = (void *)data + max_len;
        txrx_req[ch].len = len - max_len;
        len = max_len;
    } else {
        txrx_req[ch].len = 0;
    }

    // Find next SW buffer
    uint32_t chep = CHEP(ch);
    bool sw_buf = !!(chep & USB_CHEP_DTOG_RX_Msk);
    volatile uint32_t *bd = sw_buf ? &usb_sram->chep[ch].RXTXBD : &usb_sram->chep[ch].TXRXBD;

    // Copy to USB SRAM buffer
    uint32_t *dst = TXRXDB_PTR(*bd);
    const uint32_t *src = data;
    for (uint32_t i = 0; i < (len + 3) / 4; i++)
        dst[i] = src[i];
    *bd = TXBD(len, dst);
    txrx_req[ch].db_valid[sw_buf] = 1;

    chep = CHEP(ch);
    if (txrx_req[ch].first ? sw_buf == 0 :
        !!(chep & USB_CHEP_DTOG_TX_Msk) == sw_buf) {
        // Endpoint is currently stalled, start transfer
        CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_VALID(chep) | USB_CHEP_DTOG_RX_Msk;
    }
}

void usb_hw_ep_tx_stall(uint8_t ep)
{
    uint8_t ch = ep_to_tx_ch(ep);
    uint32_t chep = CHEP(ch);
    CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_STALL(chep);
}

void usb_hw_ep_tx_nak(uint8_t ep)
{
    uint8_t ch = ep_to_tx_ch(ep);
    uint32_t chep = CHEP(ch);
    CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_NAK(chep);
}

uint32_t *usb_hw_ep_tx_buffer(uint8_t ep, uint16_t *len)
{
    uint8_t ch = ep_to_tx_ch(ep);
    if (len)
        *len = ch_buf_size[ch][Tx];
    return TXRXDB_PTR(usb_sram->chep[ch].TXRXBD);
}

