zhiyb/STM32F722RE/src/usb_hw_ep.c
            case 0b00 << USB_CHEP_UTYPE_Pos:    // Bulk
                if (chep & USB_CHEP_KIND_Msk) {
                    // Double buffering support
                    txrx_req[ch].first = false;
                    bool sw_buf = !!(chep & USB_CHEP_DTOG_RX_Msk);
                    txrx_req[ch].db_valid[!sw_buf] = 0;
                    if (txrx_req[ch].db_valid[sw_buf]) {
                        // Data buffer has been filled already, continue
                        CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_VALID(chep) | USB_CHEP_DTOG_RX_Msk;
                    }
                }
                // Send IN complete event to main thread
                event_push_irq(EventIn, ch);
                CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTTX_Msk;
                break;

            default:
                DBG_BKPT("Unhandled endpoint type");
            }

        } else if (chep & 0x7e808080) {
            DBG_BKPT("Unhandled event");
        }
    }
}

void usb_hw_ep_process()
{
    // Swap event bitmap buffer
    uint8_t rdptr = hw_event.wrptr;
    hw_event.wrptr = !rdptr;
    for (uint8_t ch = 0; ch < 8; ch++) {
        uint8_t ev = hw_event.event[rdptr][ch];
        if (ev) {
            hw_event.event[rdptr][ch] = 0;
            uint32_t chep = CHEP(ch);
            uint8_t ep = chep & 0x0f;

            if (ev & EventSetup) {
                usb_ep0_setup((setup_t *)&ctrl_buf.setup);
            }

            if (ev & EventOut) {
                if ((chep & USB_CHEP_UTYPE_Msk) == (0b10 << USB_CHEP_UTYPE_Pos) ||
                    (chep & (USB_CHEP_UTYPE_Msk | USB_CHEP_KIND_Msk)) == ((0b00 << USB_CHEP_UTYPE_Pos) | USB_CHEP_KIND_Msk)) {
                    // Double buffering enabled
                    bool sw_buf = !!(chep & USB_CHEP_DTOG_TX_Msk);
                    for (uint8_t i = 0; i < 2; i++) {
                        uint8_t idx = i ^ !sw_buf;
                        if (!txrx_req[ch].db_valid[idx])
                            break;
                        uint32_t bd = idx ? usb_sram->chep[ch].TXRXBD : usb_sram->chep[ch].RXTXBD;
                        uint32_t *data = TXRXDB_PTR(bd);
                        uint16_t len = TXRXBD_COUNT(bd);
                        bool rx_valid = false;
                        switch (ep) {
                        case UsbEpBtACLData:
                            rx_valid = bt_hci_usb_acl_tx(data, len);
                            break;
                        default:
                            DBG_BKPT("Unknown endpoint");
                        }
                        if (rx_valid) {
                            // Ready for next RX
                            txrx_req[ch].db_valid[idx] = 0;
                            uint32_t chep = CHEP(ch);
                            if (!!(chep & USB_CHEP_DTOG_RX_Msk) == !!(chep & USB_CHEP_DTOG_TX_Msk)) {
                                // RX stalled, toggle SW_BUF to get ready
                                CHEP(ch) = CHEP_MASK(chep) | CHEP_RX_VALID(chep) | USB_CHEP_DTOG_TX_Msk;
                            }
                        }
                    }
                } else {
                    uint32_t bd = usb_sram->chep[ch].RXTXBD;
                    uint32_t *data = TXRXDB_PTR(bd);
                    uint16_t len = TXRXBD_COUNT(bd);
                    bool rx_valid = false;
                    switch (ep) {
                    case UsbEpCDCData:
                        rx_valid = usb_cdc_data_out(data, len);
                        break;
                    default:
                        DBG_BKPT("Unknown endpoint");
                    }
                    if (rx_valid) {
                        // Ready for next RX
                        CHEP(ch) = CHEP_MASK(chep) | CHEP_RX_VALID(chep);
                    }
                }
            }

            if (ev & EventIn) {
                switch (ep) {
                case UsbEp0Ctrl:
                    break;
                case UsbEpBtHciEvents:
                    bt_hci_usb_event_confirm();
                    break;
                case UsbEpBtACLData:
                    bt_hci_usb_acl_confirm();
                    break;
                case UsbEpCDCData:
                    usb_cdc_data_in();
                    break;
                default:
                    DBG_BKPT("Unknown endpoint");
                }
            }
        }
    }
}
